In [19]:
#creating a serise 
import pandas as pd 
import numpy as np

In [20]:
empcod = np.array([1001, 1002, 1003, 1004, 1005])

In [21]:
empcod

array([1001, 1002, 1003, 1004, 1005])

In [22]:
empname=np.array(["manish","karan","pramod","avanish","amith"])

In [23]:
empname

array(['manish', 'karan', 'pramod', 'avanish', 'amith'], dtype='<U7')

In [24]:
empcol = pd.Series(empname, index=empcod)

In [25]:
empcol

1001     manish
1002      karan
1003     pramod
1004    avanish
1005      amith
dtype: object

In [26]:
designation=pd.Series(["executive","sr manager","manager","AVP","VP"],index= empcod)

In [27]:
designation

1001     executive
1002    sr manager
1003       manager
1004           AVP
1005            VP
dtype: object

In [37]:
salary=pd.Series([50000,25000,45000,15000,30000],index=empcod)

In [38]:
salary

1001    50000
1002    25000
1003    45000
1004    15000
1005    30000
dtype: int64

In [39]:
d1={"empname":empcol,"designation":designation,"salary":salary}

In [40]:
df=pd.DataFrame(d1)

In [41]:
df

      empname designation  salary
1001   manish   executive   50000
1002    karan  sr manager   25000
1003   pramod     manager   45000
1004  avanish         AVP   15000
1005    amith          VP   30000

In [42]:
#print the shape of 
df.shape

(5, 3)

In [43]:
#print the data column
df.columns

Index(['empname', 'designation', 'salary'], dtype='object')

In [44]:
# print the first specific record
df.head(2)

     empname designation  salary
1001  manish   executive   50000
1002   karan  sr manager   25000

In [47]:
#to print last  two specific record
df.tail(2)

      empname designation  salary
1004  avanish         AVP   15000
1005    amith          VP   30000

#Row/column ke name (label based ) se select karte hain

In [50]:
df.loc[1003]

empname         pramod
designation    manager
salary           45000
Name: 1003, dtype: object

In [49]:
df.loc[1002:1004, ["empname", "salary"]]

      empname  salary
1002    karan   25000
1003   pramod   45000
1004  avanish   15000

#  use of  integer loc iloc (0-based index)

In [51]:
df.iloc[2]

empname         pramod
designation    manager
salary           45000
Name: 1003, dtype: object

In [52]:
# First 3 rows aur first 2 columns   ilocloc[startrow:stoprow,startcolumn:stop column]
df.iloc[0:3, 0:2]

     empname designation
1001  manish   executive
1002   karan  sr manager
1003  pramod     manager

In [53]:
nums=[800678,800456]
names=["richie","mark"]

In [59]:
series_1=pd.Series(nums)

In [74]:
series_1

0    800678
1    800456
dtype: int64

series_2 = pd.Series(nums, index=names)

series_2 ko directly likhne ka matlab sirf notebook ya interactive environment me output dikhega.
Agar aap normal Python script (.py) run kar rahe ho, to print(series_2) hi use karna padega, warna console me kuch bhi print nahi hoga.

In [78]:
series_2 = pd.Series(nums, index=names)
print(series_2)

richie    800678
mark      800456
dtype: int64

In [80]:
# so here this is transposition in dataframe
#Transposition matlab rows aur columns ko interchange karna.
df.T

                  1001        1002     1003     1004   1005
empname         manish       karan   pramod  avanish  amith
designation  executive  sr manager  manager      AVP     VP
salary           50000       25000    45000    15000  30000

In [81]:
df

      empname designation  salary
1001   manish   executive   50000
1002    karan  sr manager   25000
1003   pramod     manager   45000
1004  avanish         AVP   15000
1005    amith          VP   30000

In [82]:
df.dtypes

empname        object
designation    object
salary          int64
dtype: object

# 1name indxing   2 indexignlocation 2locaion  4 conditional filtering

In [83]:
#print empname
df.empname

1001     manish
1002      karan
1003     pramod
1004    avanish
1005      amith
Name: empname, dtype: object

In [84]:
df["empname"]

1001     manish
1002      karan
1003     pramod
1004    avanish
1005      amith
Name: empname, dtype: object

In [86]:
# print multitaple coumn
df[["empname","designation"]]

      empname designation
1001   manish   executive
1002    karan  sr manager
1003   pramod     manager
1004  avanish         AVP
1005    amith          VP

In [87]:
df.loc[[1002,1003],:]

     empname designation  salary
1002   karan  sr manager   25000
1003  pramod     manager   45000

In [90]:
df.loc[[1002,1003],["designation","salary"]]

     designation  salary
1002  sr manager   25000
1003     manager   45000